
&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	ОтправитьПисьмоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоНаСервере()
	
	ПисьмоHTML = ПолучитьТекстПисьмаHTML(); 
	ТелоПисьма = ПолучитьТекстПисьмаПроизвольныйТекст();
	Если ТипТекстаHtml Тогда
		ТелоПисьма = СтрШаблон(ПисьмоHTML, ТелоПисьма, "БудниПрограммиста@yandex.ru", "Тема Будни программиста", "Текст письма");
	КонецЕсли;
	ТемаПисьма = "YouTube канал ""Будни программиста""";
	ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Если ТелоПисьма <> "" Тогда
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("Тема", ТемаПисьма);
		ПараметрыСообщения.Вставить("Кому", Кому); //АдресПочты);
		ПараметрыСообщения.Вставить("Тело", ТелоПисьма);
		ПараметрыСообщения.Вставить("ТипТекста", ТипТекста);
		
		IDСообщения = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗаписьОтправителя, ПараметрыСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстПисьмаHTML() 
	
	Возврат 
	"<style>
	|.text {
	|	text-align:  center;                                                                                                
	|}
	|</style>
	|<p>%1</p>
	|<p class=""text"">
	|<a href=""mailto:%2?subject=%3&amp;body=%4"">Перейти канал ""Будни программиста""</a> <br>
	|</p>";
	
КонецФункции

&НаСервере
Функция ПолучитьТекстПисьмаПроизвольныйТекст() 
	
	Возврат "Привет, это тестовая отправка письма";
	
КонецФункции

&НаСервере
Функция ОтправитьСообщениеСервер(Путь)
	
	СтруктураНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбщиеПараметры",,,,"Администратор");
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = "smtp.yandex.ru"; //yandex,mail
	Профиль.ПользовательSMTP = СтруктураНастроек.ПочтаОтправителя;
	Профиль.ПарольSMTP = СтруктураНастроек.ПарольПочтовый;
	Профиль.ИспользоватьSSLSMTP = Истина;
	Профиль.ПортSMTP = 465; 
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;

	Письмо = Новый ИнтернетПочтовоеСообщение;
	Текст = Письмо.Тексты.Добавить("Отчёт поставщику");
	Письмо.Вложения.Добавить(Путь);
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.Тема = "Отчёт поставщику"; 
	Письмо.Отправитель = СтруктураНастроек.ПочтаОтправителя;
	Письмо.ИмяОтправителя = "YouTube канал ""Будни программиста""";
	Письмо.Получатели.Добавить(СтруктураНастроек.ПочтаПолучателя);

	Почта = Новый ИнтернетПочта;     
	Попытка
	  Почта.Подключиться(Профиль);
	  //Сообщить("Подключено");
	Исключение
	   //Сообщить("Не удалось подключиться к серверу");
	   //Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Попытка
	  Почта.Послать(Письмо);
	  //Сообщить("Письмо отправлено");
	Исключение
	   //Сообщить("Не удалось отправить письмо");
	   //Сообщить(ОписаниеОшибки());
	КонецПопытки;

	Почта.Отключиться();
	//Сообщить("Соединение завершено");
КонецФункции
